
#미니 스타크래프트 ( 턴제 )
#
#====================================================================	#턴마다 출력
#                                               		 행동 선택
#====================================================================
#						미네랄 : a	가스 : b              인구 : c
#1. 일꾼 추가	2. 유닛 생성	3. 유닛 이동	4. 건물 건설	5. 대기         0. GG
#
#====================================================================

Menu = "\t1. 일꾼 추가\t2. 유닛 생성\t3. 유닛 이동\t4. 건물 건설	\t5. 대기\t0. GG"
##scv = 일반형, 소형유닛, 인구1		드론 = 일반형, 소형유닛
##미네랄	50	
##체력,공격력,방어력 60, 5, 0			40, 5, 0
##-------------------------------------------------------------------------------------------------------
##마린 = 일반형, 소형유닛, 인구1		저글링 = 일반형, 소형유닛
##미네랄	50
##체,공,방		40, 6, 0			35, 5, 0
##-------------------------------------------------------------------------------------------------------
##고스트 = 진동형, 소형유닛, 인구 1		히드라 = 폭발형, 중형유닛
##미네랄	25	가스 75
##체,공,방		45, 10, 0			80, 10, 0
##-------------------------------------------------------------------------------------------------------
##벌쳐 = 진동형, 중형유닛, 인구2		울트라리스크 = 일반형, 대형유닛
##미네랄	75
##체,공,방		80, 20, 0			400, 20, 1
##-------------------------------------------------------------------------------------------------------
##탱크 = 폭발형, 대형유닛, 인구2
##미네랄	150	가스 100
##체,공,방		150, 30, 1
##============================================================
##=========================================
##	1. 정제소		2. 보급고
##미네랄	    100		    100
##=========================================
Ec = ("="*95)
Mineral = 0
a = []
b = []
c = []
sumM = 50
sumS = 6
W = 4 #기본일꾼
Gas = 0
Sup = 6
while True:
	print("%s\n%48s\n%s\n"%(Ec,"행동선택",Ec))
	print("\t\t\t미네랄 : %d\t가스%s\t인구%s"%(sumM,b,sumS))
	print("%s\n\n%s\n"%(Menu,Ec))
	Order = int(input("명령숫자를 입력해주세요 : "))
	if Order == 1:	
		if sumM < 50:
			print("미네랄이 부족합니다")
		elif sumS <= 0:
			print("보급고가 부족합니다")
		else:
			W = W+1		#W는 일꾼 ,일꾼 생성
			sumS -= 1
			Mineral = W*8		#W일꾼이 미네랄 8씩 케옴
			a.append(Mineral)
			sumM+=a.pop() 
		print("현재 총 일꾼 %s 마리"%W)
		
#	elif Order == 2:
	elif Order == 4:
		Mineral = W*8
		print("%s\n%45s\t%s\n%45s\t%s\n%s"%(Ec,"1. 정제소","2. 보급고","미네랄 100","미네랄 100",Ec))
		Choice = int(input("건설할 건물의 번호를 누르세요 : " ))
		if Choice == 1:
			Gas += 1
			if Gas == 2:
				Gas = 1
				print("간헐천이 부족합니다 (가스정제소 한개만 지을수 있습니다)")
			else:
				sumM = int(sumM)-100
		if Choice == 2:
			sumS += 10
#			c.append(sumS)
#			sumS+=c.pop()
			sumM = int(sumM)-100
			print("보급고 건설완료")

			
		elif sumM < 100:
			print("미네랄이 부족합니다")
#		if Gas == 1:
#			print("간헐천이 부족합니다 (가스정제소 한개만 지을수 있습니다)")
#	elif Order == 5:
