sawon 테이블에서 이름,급여[년봉], 월급여액(100단위까지만 출력하되 50원 이상은 반올림)
	세금(월급여액 5%, 0단위까지 출력하되 원단위는 절삭)을 출력.
[조건: 만원단위를 원단위로 환산]

파일 ] Alias 적용 하기!

결과 ] 이름	년급여	월급여	세금
=====================================

select sapay *1000 as "계산가능" from sawon;

select saname, round(sapay*10000,-1) as "연급여",round(sapay*10000/12,-1) as "월급여",trunc(sapay*10000*0.05,-1) from sawon;

select saname, round(sapay*10000,0) as "연급여",round(sapay*10000/12,-2) as "월급여",trunc(sapay*10000/12*0.05,-1) as "월세금" from sawon;

select saname, round(sapay*10000,0) as "연급여",round(sapay*10000/12,-2) as "월급여",trunc(sapay*10000/12*0.05,-1) as "월세금" from sawon;

SANAME                   연급여     월급여     월세금
-------------------- ---------- ---------- ----------
홍길동                 50000000    4166700     208330
한국남                 30000000    2500000     125000
이순신                 35000000    2916700     145830
이순라                 12000000    1000000      50000
놀기만                 23000000    1916700      95830
뷰별나                 16000000    1333300      66660
채시라                 34000000    2833300     141660
이성계                 28030000    2335800     116790
무궁화                 30000000    2500000     125000
임꺽정                 22000000    1833300      91660
깨똥이                 45000000    3750000     187500
공부만                 40030000    3335800     166790
채송화                 17030000    1419200      70950
이미라                 25030000    2085800     104290
공부해                 13030000    1085800      54290
뷰명한                 18000000    1500000      75000
무궁화                 11000000     916700      45830
최진실                 20000000    1666700      83330
김유신                  4000000     333300      16660
강감찬                 10030000     835800      41790

20 rows selected.